/* automatically generated by rust-bindgen 0.55.1 */

#![allow(non_snake_case)]
#![allow(non_camel_case_types)]
#![allow(non_upper_case_globals)]

pub const VX_MAX_IMPLEMENTATION_NAME: u32 = 64;
pub const VX_MAX_KERNEL_NAME: u32 = 256;
pub const VX_MAX_LOG_MESSAGE_LEN: u32 = 1024;
pub const VX_MAX_REFERENCE_NAME: u32 = 64;
pub const VX_VENDOR_MASK: u32 = 4293918720;
pub const VX_TYPE_MASK: u32 = 1048320;
pub const VX_LIBRARY_MASK: u32 = 1044480;
pub const VX_KERNEL_MASK: u32 = 4095;
pub const VX_ATTRIBUTE_ID_MASK: u32 = 255;
pub const VX_ENUM_TYPE_MASK: u32 = 1044480;
pub const VX_ENUM_MASK: u32 = 4095;
pub const VX_FMT_REF: &'static [u8; 3usize] = b"%p\0";
pub const VX_FMT_SIZE: &'static [u8; 4usize] = b"%zu\0";
pub const VX_SCALE_UNITY: u32 = 1024;
pub const VX_SCALE_PYRAMID_HALF: f64 = 0.5;
#[doc = "< \\brief The Khronos Group"]
pub const vx_vendor_id_e_VX_ID_KHRONOS: vx_vendor_id_e = 0;
#[doc = "< \\brief Texas Instruments, Inc."]
pub const vx_vendor_id_e_VX_ID_TI: vx_vendor_id_e = 1;
#[doc = "< \\brief Qualcomm, Inc."]
pub const vx_vendor_id_e_VX_ID_QUALCOMM: vx_vendor_id_e = 2;
#[doc = "< \\brief NVIDIA Corporation"]
pub const vx_vendor_id_e_VX_ID_NVIDIA: vx_vendor_id_e = 3;
#[doc = "< \\brief ARM Ltd."]
pub const vx_vendor_id_e_VX_ID_ARM: vx_vendor_id_e = 4;
#[doc = "< \\brief Berkley Design Technology, Inc."]
pub const vx_vendor_id_e_VX_ID_BDTI: vx_vendor_id_e = 5;
#[doc = "< \\brief Renasas Electronics"]
pub const vx_vendor_id_e_VX_ID_RENESAS: vx_vendor_id_e = 6;

#[doc = " shall be set to a value of \\f$ scale = unity * f \\f$. \\f$ unity \\f$ is defined as <tt>\\ref VX_SCALE_UNITY</tt>."]
#[doc = " \\arg step - The step is the number of logical pixel units to skip to"]
#[doc = " arrive at the next physically unique pixel. For example, on a plane that is"]
#[doc = " half-scaled in a dimension, the step in that dimension is 2 to indicate that"]
#[doc = " every other pixel in that dimension is an alias. This is useful in situations"]
#[doc = " where iteration over unique pixels is required, such as in serializing"]
#[doc = " or de-serializing the image patch information."]
#[doc = " \\see <tt>\\ref vxMapImagePatch</tt>"]
#[doc = " \\note For <tt>\\ref VX_DF_IMAGE_U1</tt> images it is defined that \\a stride_x == 0 since it is less than one byte."]
#[doc = " The least significant bit (bit number 0, value 1) in the first byte in the image,"]
#[doc = " is the left-most pixel in the upper left corner, i.e. origo. A <tt>\\ref VX_DF_IMAGE_U1</tt> image always"]
#[doc = " start on a byte boundary and each row has a \\a stride_y that is a multiple of whole bytes, which means padding"]
#[doc = " bits of undefined value may be present at the end of each row."]
#[doc = " Imagepatches can only be accessed at a multiple of eight pixels: the x-coordinate must be a multiple of eight."]
#[doc = " Individual pixel access is also different: the byte at the imagepatch-calculated pointer value is a collection of eight pixels."]
#[doc = " Each byte can then be masked with the bit-mask <tt> 1 << (x % 8)</tt> to get individual pixel values (shifted <tt>x</tt> times)."]
#[doc = " See \\ref sub_image_access for an example."]
#[doc = " \\ingroup group_image"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _vx_imagepatch_addressing_t {
    #[doc = "< \\brief Width of patch in X dimension in pixels."]
    pub dim_x: vx_uint32,
    #[doc = "< \\brief Height of patch in Y dimension in pixels."]
    pub dim_y: vx_uint32,
    #[doc = "< \\brief Stride in X dimension in bytes."]
    pub stride_x: vx_int32,
    #[doc = "< \\brief Stride in Y dimension in bytes."]
    pub stride_y: vx_int32,
    #[doc = "< \\brief Scale of X dimension. For sub-sampled planes this is the scaling factor of the dimension of the plane in relation to the zero plane. Use <tt>\\ref VX_SCALE_UNITY</tt> in the numerator."]
    pub scale_x: vx_uint32,
    #[doc = "< \\brief Scale of Y dimension. For sub-sampled planes this is the scaling factor of the dimension of the plane in relation to the zero plane. Use <tt>\\ref VX_SCALE_UNITY</tt> in the numerator."]
    pub scale_y: vx_uint32,
    #[doc = "< \\brief Step of X dimension in pixels."]
    pub step_x: vx_uint32,
    #[doc = "< \\brief Step of Y dimension in pixels."]
    pub step_y: vx_uint16,
    #[doc = "< \\brief Stride in X dimension in bits. Used when stride_x is not an integer number of bytes."]
    pub stride_x_bits: vx_uint16,
}
#[test]
fn bindgen_test_layout__vx_imagepatch_addressing_t() {
    assert_eq!(
        ::std::mem::size_of::<_vx_imagepatch_addressing_t>(),
        32usize,
        concat!("Size of: ", stringify!(_vx_imagepatch_addressing_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_vx_imagepatch_addressing_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_vx_imagepatch_addressing_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_vx_imagepatch_addressing_t>())).dim_x as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_imagepatch_addressing_t),
            "::",
            stringify!(dim_x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_vx_imagepatch_addressing_t>())).dim_y as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_imagepatch_addressing_t),
            "::",
            stringify!(dim_y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_vx_imagepatch_addressing_t>())).stride_x as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_imagepatch_addressing_t),
            "::",
            stringify!(stride_x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_vx_imagepatch_addressing_t>())).stride_y as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_imagepatch_addressing_t),
            "::",
            stringify!(stride_y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_vx_imagepatch_addressing_t>())).scale_x as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_imagepatch_addressing_t),
            "::",
            stringify!(scale_x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_vx_imagepatch_addressing_t>())).scale_y as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_imagepatch_addressing_t),
            "::",
            stringify!(scale_y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_vx_imagepatch_addressing_t>())).step_x as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_imagepatch_addressing_t),
            "::",
            stringify!(step_x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_vx_imagepatch_addressing_t>())).step_y as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_imagepatch_addressing_t),
            "::",
            stringify!(step_y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_vx_imagepatch_addressing_t>())).stride_x_bits as *const _
                as usize
        },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_imagepatch_addressing_t),
            "::",
            stringify!(stride_x_bits)
        )
    );
}
#[doc = " \\brief The addressing image patch structure is used by the Host only"]
#[doc = " to address pixels in an image patch. The fields of the structure are defined as:"]
#[doc = " \\arg dim - The dimensions of the image in logical pixel units in the x & y direction."]
#[doc = " \\arg stride - The physical byte distance from a logical pixel to the next"]
#[doc = " logically adjacent pixel in the positive x or y direction."]
#[doc = " \\arg scale - The relationship of scaling from the primary plane (typically"]
#[doc = " the zero indexed plane) to this plane. An integer down-scaling factor of \\f$ f \\f$ shall be"]
#[doc = " set to a value equal to \\f$ scale = \\frac{unity}{f} \\f$ and an integer up-scaling factor of \\f$ f \\f$"]
#[doc = " shall be set to a value of \\f$ scale = unity * f \\f$. \\f$ unity \\f$ is defined as <tt>\\ref VX_SCALE_UNITY</tt>."]
#[doc = " \\arg step - The step is the number of logical pixel units to skip to"]
#[doc = " arrive at the next physically unique pixel. For example, on a plane that is"]
#[doc = " half-scaled in a dimension, the step in that dimension is 2 to indicate that"]
#[doc = " every other pixel in that dimension is an alias. This is useful in situations"]
#[doc = " where iteration over unique pixels is required, such as in serializing"]
#[doc = " or de-serializing the image patch information."]
#[doc = " \\see <tt>\\ref vxMapImagePatch</tt>"]
#[doc = " \\note For <tt>\\ref VX_DF_IMAGE_U1</tt> images it is defined that \\a stride_x == 0 since it is less than one byte."]
#[doc = " The least significant bit (bit number 0, value 1) in the first byte in the image,"]
#[doc = " is the left-most pixel in the upper left corner, i.e. origo. A <tt>\\ref VX_DF_IMAGE_U1</tt> image always"]
#[doc = " start on a byte boundary and each row has a \\a stride_y that is a multiple of whole bytes, which means padding"]
#[doc = " bits of undefined value may be present at the end of each row."]
#[doc = " Imagepatches can only be accessed at a multiple of eight pixels: the x-coordinate must be a multiple of eight."]
#[doc = " Individual pixel access is also different: the byte at the imagepatch-calculated pointer value is a collection of eight pixels."]
#[doc = " Each byte can then be masked with the bit-mask <tt> 1 << (x % 8)</tt> to get individual pixel values (shifted <tt>x</tt> times)."]
#[doc = " See \\ref sub_image_access for an example."]
#[doc = " \\ingroup group_image"]
pub type vx_imagepatch_addressing_t = _vx_imagepatch_addressing_t;
#[doc = " \\brief The performance measurement structure. The time or durations are in units of nano seconds."]
#[doc = " \\ingroup group_performance"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _vx_perf_t {
    #[doc = "< \\brief Holds the last measurement."]
    pub tmp: vx_uint64,
    #[doc = "< \\brief Holds the first measurement in a set."]
    pub beg: vx_uint64,
    #[doc = "< \\brief Holds the last measurement in a set."]
    pub end: vx_uint64,
    #[doc = "< \\brief Holds the summation of durations."]
    pub sum: vx_uint64,
    #[doc = "< \\brief Holds the average of the durations."]
    pub avg: vx_uint64,
    #[doc = "< \\brief Holds the minimum of the durations."]
    pub min: vx_uint64,
    #[doc = "< \\brief Holds the number of measurements."]
    pub num: vx_uint64,
    #[doc = "< \\brief Holds the maximum of the durations."]
    pub max: vx_uint64,
}
#[test]
fn bindgen_test_layout__vx_perf_t() {
    assert_eq!(
        ::std::mem::size_of::<_vx_perf_t>(),
        64usize,
        concat!("Size of: ", stringify!(_vx_perf_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_vx_perf_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_vx_perf_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_perf_t>())).tmp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_perf_t),
            "::",
            stringify!(tmp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_perf_t>())).beg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_perf_t),
            "::",
            stringify!(beg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_perf_t>())).end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_perf_t),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_perf_t>())).sum as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_perf_t),
            "::",
            stringify!(sum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_perf_t>())).avg as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_perf_t),
            "::",
            stringify!(avg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_perf_t>())).min as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_perf_t),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_perf_t>())).num as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_perf_t),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_perf_t>())).max as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_perf_t),
            "::",
            stringify!(max)
        )
    );
}
#[doc = " \\brief The performance measurement structure. The time or durations are in units of nano seconds."]
#[doc = " \\ingroup group_performance"]
pub type vx_perf_t = _vx_perf_t;
#[doc = " \\brief Hough lines probability parameters."]
#[doc = " \\ingroup group_vision_function_hough_lines_p"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _vx_hough_lines_p_t {
    #[doc = " \\brief  Distance resolution of the parameter in pixels."]
    pub rho: vx_float32,
    #[doc = " \\brief Angle resolution of the parameter in radians."]
    pub theta: vx_float32,
    #[doc = " \\brief The minimum number of intersections to detect a line."]
    pub threshold: vx_int32,
    #[doc = " \\brief The minimum number of points that can form a line. Line segments shorter than that are rejected."]
    pub line_length: vx_int32,
    #[doc = " \\brief The maximum allowed gap between points on the same line to link them."]
    pub line_gap: vx_int32,
    #[doc = " \\brief Optional restriction on theta. The max allowed value."]
    pub theta_max: vx_float32,
    #[doc = " \\brief Optional restriction on theta. The min allowed value."]
    pub theta_min: vx_float32,
}
#[test]
fn bindgen_test_layout__vx_hough_lines_p_t() {
    assert_eq!(
        ::std::mem::size_of::<_vx_hough_lines_p_t>(),
        28usize,
        concat!("Size of: ", stringify!(_vx_hough_lines_p_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_vx_hough_lines_p_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_vx_hough_lines_p_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_hough_lines_p_t>())).rho as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_hough_lines_p_t),
            "::",
            stringify!(rho)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_hough_lines_p_t>())).theta as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_hough_lines_p_t),
            "::",
            stringify!(theta)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_hough_lines_p_t>())).threshold as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_hough_lines_p_t),
            "::",
            stringify!(threshold)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_hough_lines_p_t>())).line_length as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_hough_lines_p_t),
            "::",
            stringify!(line_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_hough_lines_p_t>())).line_gap as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_hough_lines_p_t),
            "::",
            stringify!(line_gap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_hough_lines_p_t>())).theta_max as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_hough_lines_p_t),
            "::",
            stringify!(theta_max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_hough_lines_p_t>())).theta_min as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_hough_lines_p_t),
            "::",
            stringify!(theta_min)
        )
    );
}
#[doc = " \\brief Hough lines probability parameters."]
#[doc = " \\ingroup group_vision_function_hough_lines_p"]
pub type vx_hough_lines_p_t = _vx_hough_lines_p_t;
#[doc = " \\brief line struct"]
#[doc = " \\ingroup group_basic_features"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _vx_line2d_t {
    #[doc = " \\brief x index of line start"]
    pub start_x: vx_float32,
    #[doc = " \\brief y index of line start"]
    pub start_y: vx_float32,
    #[doc = " \\brief x index of line end"]
    pub end_x: vx_float32,
    #[doc = " \\brief y index of line end"]
    pub end_y: vx_float32,
}
#[test]
fn bindgen_test_layout__vx_line2d_t() {
    assert_eq!(
        ::std::mem::size_of::<_vx_line2d_t>(),
        16usize,
        concat!("Size of: ", stringify!(_vx_line2d_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_vx_line2d_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_vx_line2d_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_line2d_t>())).start_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_line2d_t),
            "::",
            stringify!(start_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_line2d_t>())).start_y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_line2d_t),
            "::",
            stringify!(start_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_line2d_t>())).end_x as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_line2d_t),
            "::",
            stringify!(end_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_line2d_t>())).end_y as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_line2d_t),
            "::",
            stringify!(end_y)
        )
    );
}
#[doc = " \\brief line struct"]
#[doc = " \\ingroup group_basic_features"]
pub type vx_line2d_t = _vx_line2d_t;
#[doc = " \\brief Matrix Multiply Parameters"]
#[doc = ""]
#[doc = " transpose_input1/input2/input3 : if True the matrix is transposed before the operation, otherwise the matrix is used as is. \\n"]
#[doc = " \\ingroup group_vision_function_tensor_matrix_multiply"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _vx_tensor_matrix_multiply_params_t {
    #[doc = " \\brief if True the matrix is transposed before the operation, otherwise the matrix is used as is"]
    pub transpose_input1: vx_bool,
    #[doc = " \\brief if True the matrix is transposed before the operation, otherwise the matrix is used as is"]
    pub transpose_input2: vx_bool,
    #[doc = " \\brief if True the matrix is transposed before the operation, otherwise the matrix is used as is"]
    pub transpose_input3: vx_bool,
}
#[test]
fn bindgen_test_layout__vx_tensor_matrix_multiply_params_t() {
    assert_eq!(
        ::std::mem::size_of::<_vx_tensor_matrix_multiply_params_t>(),
        12usize,
        concat!("Size of: ", stringify!(_vx_tensor_matrix_multiply_params_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_vx_tensor_matrix_multiply_params_t>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_vx_tensor_matrix_multiply_params_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_vx_tensor_matrix_multiply_params_t>())).transpose_input1
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_tensor_matrix_multiply_params_t),
            "::",
            stringify!(transpose_input1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_vx_tensor_matrix_multiply_params_t>())).transpose_input2
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_tensor_matrix_multiply_params_t),
            "::",
            stringify!(transpose_input2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_vx_tensor_matrix_multiply_params_t>())).transpose_input3
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_tensor_matrix_multiply_params_t),
            "::",
            stringify!(transpose_input3)
        )
    );
}
#[doc = " \\brief Matrix Multiply Parameters"]
#[doc = ""]
#[doc = " transpose_input1/input2/input3 : if True the matrix is transposed before the operation, otherwise the matrix is used as is. \\n"]
#[doc = " \\ingroup group_vision_function_tensor_matrix_multiply"]
pub type vx_tensor_matrix_multiply_params_t = _vx_tensor_matrix_multiply_params_t;
#[doc = " \\brief The Kernel Information Structure. This is returned by the Context"]
#[doc = " to indicate which kernels are available in the OpenVX implementation."]
#[doc = " \\ingroup group_kernel"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _vx_kernel_info_t {
    #[doc = " \\brief The kernel enumeration value from <tt>\\ref vx_kernel_e</tt> (or an"]
    #[doc = " extension thereof)."]
    #[doc = " \\see vxGetKernelByEnum"]
    pub enumeration: vx_enum,
    #[doc = " \\brief The kernel name in dotted hierarchical format."]
    #[doc = " e.g. \"org.khronos.openvx.sobel_3x3\""]
    #[doc = " \\see vxGetKernelByName"]
    pub name: [vx_char; 256usize],
}
#[test]
fn bindgen_test_layout__vx_kernel_info_t() {
    assert_eq!(
        ::std::mem::size_of::<_vx_kernel_info_t>(),
        260usize,
        concat!("Size of: ", stringify!(_vx_kernel_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_vx_kernel_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_vx_kernel_info_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_kernel_info_t>())).enumeration as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_kernel_info_t),
            "::",
            stringify!(enumeration)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_kernel_info_t>())).name as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_kernel_info_t),
            "::",
            stringify!(name)
        )
    );
}
#[doc = " \\brief The Kernel Information Structure. This is returned by the Context"]
#[doc = " to indicate which kernels are available in the OpenVX implementation."]
#[doc = " \\ingroup group_kernel"]
pub type vx_kernel_info_t = _vx_kernel_info_t;
#[doc = " \\brief The keypoint data structure."]
#[doc = " \\ingroup group_basic_features"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _vx_keypoint_t {
    #[doc = "< \\brief The x coordinate."]
    pub x: vx_int32,
    #[doc = "< \\brief The y coordinate."]
    pub y: vx_int32,
    #[doc = "< \\brief The strength of the keypoint. Its definition is specific to the corner detector."]
    pub strength: vx_float32,
    #[doc = "< \\brief Initialized to 0 by corner detectors."]
    pub scale: vx_float32,
    #[doc = "< \\brief Initialized to 0 by corner detectors."]
    pub orientation: vx_float32,
    #[doc = "< \\brief A zero indicates a lost point. Initialized to 1 by corner detectors."]
    pub tracking_status: vx_int32,
    #[doc = "< \\brief A tracking method specific error. Initialized to 0 by corner detectors."]
    pub error: vx_float32,
}
#[test]
fn bindgen_test_layout__vx_keypoint_t() {
    assert_eq!(
        ::std::mem::size_of::<_vx_keypoint_t>(),
        28usize,
        concat!("Size of: ", stringify!(_vx_keypoint_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_vx_keypoint_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_vx_keypoint_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_keypoint_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_keypoint_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_keypoint_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_keypoint_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_keypoint_t>())).strength as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_keypoint_t),
            "::",
            stringify!(strength)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_keypoint_t>())).scale as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_keypoint_t),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_keypoint_t>())).orientation as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_keypoint_t),
            "::",
            stringify!(orientation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_keypoint_t>())).tracking_status as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_keypoint_t),
            "::",
            stringify!(tracking_status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_keypoint_t>())).error as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_keypoint_t),
            "::",
            stringify!(error)
        )
    );
}
#[doc = " \\brief The keypoint data structure."]
#[doc = " \\ingroup group_basic_features"]
pub type vx_keypoint_t = _vx_keypoint_t;
#[doc = " \\brief The rectangle data structure that is shared with the users. The area of the rectangle can be computed as (end_x-start_x)*(end_y-start_y)."]
#[doc = " \\ingroup group_basic_features"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _vx_rectangle_t {
    #[doc = "< \\brief The Start X coordinate."]
    pub start_x: vx_uint32,
    #[doc = "< \\brief The Start Y coordinate."]
    pub start_y: vx_uint32,
    #[doc = "< \\brief The End X coordinate."]
    pub end_x: vx_uint32,
    #[doc = "< \\brief The End Y coordinate."]
    pub end_y: vx_uint32,
}
#[test]
fn bindgen_test_layout__vx_rectangle_t() {
    assert_eq!(
        ::std::mem::size_of::<_vx_rectangle_t>(),
        16usize,
        concat!("Size of: ", stringify!(_vx_rectangle_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_vx_rectangle_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_vx_rectangle_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_rectangle_t>())).start_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_rectangle_t),
            "::",
            stringify!(start_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_rectangle_t>())).start_y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_rectangle_t),
            "::",
            stringify!(start_y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_rectangle_t>())).end_x as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_rectangle_t),
            "::",
            stringify!(end_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_rectangle_t>())).end_y as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_rectangle_t),
            "::",
            stringify!(end_y)
        )
    );
}
#[doc = " \\brief The rectangle data structure that is shared with the users. The area of the rectangle can be computed as (end_x-start_x)*(end_y-start_y)."]
#[doc = " \\ingroup group_basic_features"]
pub type vx_rectangle_t = _vx_rectangle_t;
#[doc = " \\brief The 2D Coordinates structure."]
#[doc = " \\ingroup group_basic_features"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _vx_coordinates2d_t {
    #[doc = "< \\brief The X coordinate."]
    pub x: vx_uint32,
    #[doc = "< \\brief The Y coordinate."]
    pub y: vx_uint32,
}
#[test]
fn bindgen_test_layout__vx_coordinates2d_t() {
    assert_eq!(
        ::std::mem::size_of::<_vx_coordinates2d_t>(),
        8usize,
        concat!("Size of: ", stringify!(_vx_coordinates2d_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_vx_coordinates2d_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_vx_coordinates2d_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_coordinates2d_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_coordinates2d_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_coordinates2d_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_coordinates2d_t),
            "::",
            stringify!(y)
        )
    );
}
#[doc = " \\brief The 2D Coordinates structure."]
#[doc = " \\ingroup group_basic_features"]
pub type vx_coordinates2d_t = _vx_coordinates2d_t;
#[doc = " \\brief The floating-point 2D Coordinates structure."]
#[doc = " \\ingroup group_basic_features"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _vx_coordinates2df_t {
    #[doc = "< \\brief The X coordinate."]
    pub x: vx_float32,
    #[doc = "< \\brief The Y coordinate."]
    pub y: vx_float32,
}
#[test]
fn bindgen_test_layout__vx_coordinates2df_t() {
    assert_eq!(
        ::std::mem::size_of::<_vx_coordinates2df_t>(),
        8usize,
        concat!("Size of: ", stringify!(_vx_coordinates2df_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_vx_coordinates2df_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_vx_coordinates2df_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_coordinates2df_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_coordinates2df_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_coordinates2df_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_coordinates2df_t),
            "::",
            stringify!(y)
        )
    );
}
#[doc = " \\brief The floating-point 2D Coordinates structure."]
#[doc = " \\ingroup group_basic_features"]
pub type vx_coordinates2df_t = _vx_coordinates2df_t;
#[doc = " \\brief The 3D Coordinates structure."]
#[doc = " \\ingroup group_basic_features"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _vx_coordinates3d_t {
    #[doc = "< \\brief The X coordinate."]
    pub x: vx_uint32,
    #[doc = "< \\brief The Y coordinate."]
    pub y: vx_uint32,
    #[doc = "< \\brief The Z coordinate."]
    pub z: vx_uint32,
}
#[test]
fn bindgen_test_layout__vx_coordinates3d_t() {
    assert_eq!(
        ::std::mem::size_of::<_vx_coordinates3d_t>(),
        12usize,
        concat!("Size of: ", stringify!(_vx_coordinates3d_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_vx_coordinates3d_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_vx_coordinates3d_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_coordinates3d_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_coordinates3d_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_coordinates3d_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_coordinates3d_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_coordinates3d_t>())).z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_coordinates3d_t),
            "::",
            stringify!(z)
        )
    );
}
#[doc = " \\brief The 3D Coordinates structure."]
#[doc = " \\ingroup group_basic_features"]
pub type vx_coordinates3d_t = _vx_coordinates3d_t;
#[doc = " \\brief Union that describes the value of a pixel for any image format. Use the field"]
#[doc = " corresponding to the image format."]
#[doc = " \\ingroup group_image"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _vx_pixel_value_t {
    #[doc = "< \\brief <tt>\\ref VX_DF_IMAGE_RGB</tt> format in the R,G,B order"]
    pub RGB: [vx_uint8; 3usize],
    #[doc = "< \\brief <tt>\\ref VX_DF_IMAGE_RGBX</tt> format in the R,G,B,X order"]
    pub RGBX: [vx_uint8; 4usize],
    #[doc = "< \\brief All YUV formats in the Y,U,V order"]
    pub YUV: [vx_uint8; 3usize],
    #[doc = "< \\brief <tt>\\ref VX_DF_IMAGE_U1</tt>"]
    pub U1: vx_bool,
    #[doc = "< \\brief <tt>\\ref VX_DF_IMAGE_U8</tt>"]
    pub U8: vx_uint8,
    #[doc = "< \\brief <tt>\\ref VX_DF_IMAGE_U16</tt>"]
    pub U16: vx_uint16,
    #[doc = "< \\brief <tt>\\ref VX_DF_IMAGE_S16</tt>"]
    pub S16: vx_int16,
    #[doc = "< \\brief <tt>\\ref VX_DF_IMAGE_U32</tt>"]
    pub U32: vx_uint32,
    #[doc = "< \\brief <tt>\\ref VX_DF_IMAGE_S32</tt>"]
    pub S32: vx_int32,
    pub reserved: [vx_uint8; 16usize],
    _bindgen_union_align: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__vx_pixel_value_t() {
    assert_eq!(
        ::std::mem::size_of::<_vx_pixel_value_t>(),
        16usize,
        concat!("Size of: ", stringify!(_vx_pixel_value_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_vx_pixel_value_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_vx_pixel_value_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_pixel_value_t>())).RGB as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_pixel_value_t),
            "::",
            stringify!(RGB)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_pixel_value_t>())).RGBX as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_pixel_value_t),
            "::",
            stringify!(RGBX)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_pixel_value_t>())).YUV as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_pixel_value_t),
            "::",
            stringify!(YUV)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_pixel_value_t>())).U1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_pixel_value_t),
            "::",
            stringify!(U1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_pixel_value_t>())).U8 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_pixel_value_t),
            "::",
            stringify!(U8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_pixel_value_t>())).U16 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_pixel_value_t),
            "::",
            stringify!(U16)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_pixel_value_t>())).S16 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_pixel_value_t),
            "::",
            stringify!(S16)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_pixel_value_t>())).U32 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_pixel_value_t),
            "::",
            stringify!(U32)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_pixel_value_t>())).S32 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_pixel_value_t),
            "::",
            stringify!(S32)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_pixel_value_t>())).reserved as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_pixel_value_t),
            "::",
            stringify!(reserved)
        )
    );
}
#[doc = " \\brief Union that describes the value of a pixel for any image format. Use the field"]
#[doc = " corresponding to the image format."]
#[doc = " \\ingroup group_image"]
pub type vx_pixel_value_t = _vx_pixel_value_t;
#[doc = " \\brief The HOG descriptor structure."]
#[doc = " \\ingroup group_vision_function_hog"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vx_hog_t {
    #[doc = " \\brief   The histogram cell width of type <tt>\\ref VX_TYPE_INT32</tt>."]
    pub cell_width: vx_int32,
    #[doc = " \\brief   The histogram cell height of type <tt>\\ref VX_TYPE_INT32</tt>."]
    pub cell_height: vx_int32,
    #[doc = " \\brief  The histogram block width of type <tt>\\ref VX_TYPE_INT32</tt>.  Must be divisible by cell_width."]
    pub block_width: vx_int32,
    #[doc = " \\brief  The histogram block height of type <tt>\\ref VX_TYPE_INT32</tt>.  Must be divisible by cell_height."]
    pub block_height: vx_int32,
    #[doc = " \\brief  The histogram block stride within the window of type <tt>\\ref VX_TYPE_INT32</tt>.  Must be an integral number of cell_width and cell_height."]
    pub block_stride: vx_int32,
    #[doc = " \\brief  The histogram size of type <tt>\\ref VX_TYPE_INT32</tt>."]
    pub num_bins: vx_int32,
    #[doc = " \\brief  The feature descriptor window width of type <tt>\\ref VX_TYPE_INT32</tt>"]
    pub window_width: vx_int32,
    #[doc = " \\brief  The feature descriptor window height of type <tt>\\ref VX_TYPE_INT32</tt>"]
    pub window_height: vx_int32,
    #[doc = " \\brief The feature descriptor window stride of type <tt>\\ref VX_TYPE_INT32</tt>"]
    pub window_stride: vx_int32,
    #[doc = " \\brief The threshold for the maximum L2-norm value for a histogram bin.  It is used as part of block normalization.  It defaults to 0.2."]
    pub threshold: vx_float32,
}
#[test]
fn bindgen_test_layout_vx_hog_t() {
    assert_eq!(
        ::std::mem::size_of::<vx_hog_t>(),
        40usize,
        concat!("Size of: ", stringify!(vx_hog_t))
    );
    assert_eq!(
        ::std::mem::align_of::<vx_hog_t>(),
        4usize,
        concat!("Alignment of ", stringify!(vx_hog_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vx_hog_t>())).cell_width as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vx_hog_t),
            "::",
            stringify!(cell_width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vx_hog_t>())).cell_height as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vx_hog_t),
            "::",
            stringify!(cell_height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vx_hog_t>())).block_width as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vx_hog_t),
            "::",
            stringify!(block_width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vx_hog_t>())).block_height as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(vx_hog_t),
            "::",
            stringify!(block_height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vx_hog_t>())).block_stride as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vx_hog_t),
            "::",
            stringify!(block_stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vx_hog_t>())).num_bins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(vx_hog_t),
            "::",
            stringify!(num_bins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vx_hog_t>())).window_width as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vx_hog_t),
            "::",
            stringify!(window_width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vx_hog_t>())).window_height as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(vx_hog_t),
            "::",
            stringify!(window_height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vx_hog_t>())).window_stride as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(vx_hog_t),
            "::",
            stringify!(window_stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vx_hog_t>())).threshold as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(vx_hog_t),
            "::",
            stringify!(threshold)
        )
    );
}
#[doc = " \\brief Use with the enumeration <tt>\\ref VX_NODE_BORDER</tt> to set the"]
#[doc = " border mode behavior of a node that supports borders."]
#[doc = ""]
#[doc = " If the indicated border mode is not supported, an error <tt>\\ref VX_ERROR_NOT_SUPPORTED</tt> will be reported"]
#[doc = " either at the time the <tt>\\ref VX_NODE_BORDER</tt> is set or at the time of graph verification."]
#[doc = " \\ingroup group_borders"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _vx_border_t {
    #[doc = " \\brief See <tt>\\ref vx_border_e</tt>."]
    pub mode: vx_enum,
    #[doc = " \\brief For the mode <tt>\\ref VX_BORDER_CONSTANT</tt>, this union contains the"]
    #[doc = " value of out-of-bound pixels."]
    pub constant_value: vx_pixel_value_t,
}
#[test]
fn bindgen_test_layout__vx_border_t() {
    assert_eq!(
        ::std::mem::size_of::<_vx_border_t>(),
        20usize,
        concat!("Size of: ", stringify!(_vx_border_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_vx_border_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_vx_border_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_border_t>())).mode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_border_t),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_vx_border_t>())).constant_value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_vx_border_t),
            "::",
            stringify!(constant_value)
        )
    );
}
#[doc = " \\brief Use with the enumeration <tt>\\ref VX_NODE_BORDER</tt> to set the"]
#[doc = " border mode behavior of a node that supports borders."]
#[doc = ""]
#[doc = " If the indicated border mode is not supported, an error <tt>\\ref VX_ERROR_NOT_SUPPORTED</tt> will be reported"]
#[doc = " either at the time the <tt>\\ref VX_NODE_BORDER</tt> is set or at the time of graph verification."]
#[doc = " \\ingroup group_borders"]
pub type vx_border_t = _vx_border_t;
#[doc = " \\brief The type of the <tt>vxPublishKernels</tt> entry function of modules loaded"]
#[doc = " by <tt>\\ref vxLoadKernels</tt> and unloaded by <tt>\\ref vxUnloadKernels</tt>."]
#[doc = " \\param [in] context The reference to the context kernels must be added to."]
#[doc = " \\ingroup group_user_kernels"]
pub type vx_publish_kernels_f =
